Import pandas

In [1]:
import pandas as pd

Reading data from CSVs

In [2]:
data = pd.read_csv('datagg.csv')

In [3]:
data

   Unnamed: 0   Name  Age  Rating
0           0    Tom   25    4.23
1           1  James   26    3.24
2           2  ricky   25    3.98
3           3    Vin   23    2.56
4           4  Steve   30    3.20
5           5  smith   29    4.60
6           6   Jack   23    3.80

In [4]:
data.head()

   Unnamed: 0   Name  Age  Rating
0           0    Tom   25    4.23
1           1  James   26    3.24
2           2  ricky   25    3.98
3           3    Vin   23    2.56
4           4  Steve   30    3.20

In [5]:
data.tail()

   Unnamed: 0   Name  Age  Rating
2           2  ricky   25    3.98
3           3    Vin   23    2.56
4           4  Steve   30    3.20
5           5  smith   29    4.60
6           6   Jack   23    3.80

In [6]:
df =pd.DataFrame(data)

In [7]:
print (df)

   Unnamed: 0   Name  Age  Rating
0           0    Tom   25    4.23
1           1  James   26    3.24
2           2  ricky   25    3.98
3           3    Vin   23    2.56
4           4  Steve   30    3.20
5           5  smith   29    4.60
6           6   Jack   23    3.80

In [8]:
df.head()

   Unnamed: 0   Name  Age  Rating
0           0    Tom   25    4.23
1           1  James   26    3.24
2           2  ricky   25    3.98
3           3    Vin   23    2.56
4           4  Steve   30    3.20

In [9]:
df.shape

(7, 4)

In [10]:
df['Name']

0      Tom
1    James
2    ricky
3      Vin
4    Steve
5    smith
6     Jack
Name: Name, dtype: object

In [11]:
for row in df.itertuples():
    print (row)

Pandas(Index=0, _1=0, Name='Tom', Age=25, Rating=4.23)
Pandas(Index=1, _1=1, Name='James', Age=26, Rating=3.24)
Pandas(Index=2, _1=2, Name='ricky', Age=25, Rating=3.98)
Pandas(Index=3, _1=3, Name='Vin', Age=23, Rating=2.56)
Pandas(Index=4, _1=4, Name='Steve', Age=30, Rating=3.2)
Pandas(Index=5, _1=5, Name='smith', Age=29, Rating=4.6)
Pandas(Index=6, _1=6, Name='Jack', Age=23, Rating=3.8)

In [12]:
for row in df.itertuples():
    print (row[1],row[2],row[3])

0 Tom 25
1 James 26
2 ricky 25
3 Vin 23
4 Steve 30
5 smith 29
6 Jack 23

# ~~Write function to search Name by max Age, min Age~~
# ~~Write function to print mean of Age, mean of Rating~~
# 1. Write function to print Name detail from 3 to 5 in the list 
# 2. Write a function to count how many Name have the first capital letter
# 3. Write a function to count how many Name have the first low letter
# 4. Write a function to print Name by Rating >=3.5
# 5. Write a Python program to find the name have second smallest Age
# 6. Write a Python program to find the name have second largest Age
# 7. Write a function to count how many Name have 3 letters
# 8. Write a function to sort the name along with age from min to max
# 10. Write a function to remove names that have the same age
## 1 - LY, 2 - NHAN, 3- KHANH, 4 - Quan, 5 - TAI, 6 - LONG, 7 - CHAU, 8 - DAT, 9 - HUY, 10 - HOAN, 11 - THU